tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

brew 'coreutils'
brew 'ffmpeg'
brew 'fzf'
brew 'ghq'
brew 'gibo'
brew 'git'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'grep'
brew 'go'
brew 'hub'
brew 'mas'
brew 'nkf'
brew 'python'
brew 'tig'
brew 'tree'
brew 'vim', args: ['with-lua', 'with-luajit']
brew 'wget'
brew 'zplug'
brew 'zsh', args: ['without-etcdir']
brew 'zsh-completions'

cask 'dropbox'
cask 'iterm2'
cask 'mendeley-desktop'
cask 'spotify'
cask 'vivaldi'
cask 'xld'

cask 'font-source-han-code-jp'
cask 'font-inconsolata'
cask 'font-noto-sans-cjk-jp'
cask 'font-roboto'

mas 'Airmail 3', id: 918858936
