tap "homebrew/bundle"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"

brew "coreutils"
brew "curl"
brew "ffmpeg"
brew "gcc"
brew "gibo"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "grep"
brew "go"
brew "imagemagick"
brew "mas"
brew "nkf"
brew "python"
brew "tree"
brew "vim"
brew "wget"
brew "zsh"
brew "qmk/qmk/qmk"
brew "aquaproj/aqua/aqua"

cask "adobe-acrobat-reader"
cask "adoptopenjdk"
cask "discord"
cask "dropbox"
cask "fl-studio"
cask "gcc-arm-embedded"
cask "ghostty"
cask "google-chrome"
cask "inkscape"
cask "iterm2"
cask "kicad"
cask "qmk-toolbox"
cask "spotify"
cask "thunderbird"
cask "vial"
cask "visual-studio-code"
cask "vivaldi"
cask "wezterm"

cask "font-source-code-pro-for-powerline"
cask "font-inconsolata"
casl "font-monaspace-nerd-font"
cask "font-noto-sans-cjk-jp"
cask "font-roboto"

mas "Adobe Lightroom", id: 1451544217

vscode "astro-build.astro-vscode"
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "katjanakosic.vscode-json5"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "negokaz.zenn-editor"
vscode "phoenisx.cssvar"
vscode "rust-lang.rust-analyzer"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "wayou.vscode-todo-highlight"
vscode "yummygum.city-lights-theme"
